Revit 2027 API
AnalyticalEquipmentLoadData.Voltage Property
 The voltage of the analytical equipment load.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Voltage { get; set; }
Public Property Voltage As Double
	Get
	Set
public:
property double Voltage {
	double get ();
	void set (double value);
}
member Voltage : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for voltage is not a number -or- When setting this property: The given value for voltage is not finite
ArgumentOutOfRangeException |  When setting this property: The given value for voltage must be positive.
See Also
Reference
AnalyticalEquipmentLoadData Class
Autodesk.Revit.DB.Electrical Namespace